Revit 2024 API
Macro Class
 An individual Autodesk Revit Macro which can be executed.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class Macro : IDisposable
Visual Basic
Public Class Macro _
	Implements IDisposable
Visual C++
public ref class Macro : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.Macro
See Also
Macro Members
Autodesk.Revit.DB.Macros Namespace